let obj2 = [
	{'номер вопроса': 1,
	'вопрос': 'На какую сумму Роспотребнадзор оштрафовал продуктовую сеть «Вкусвилл»?',
	'ответы': ['6,3 млн рублей', '1 млн рублей', '50 млн рублей', 'Не оштрафовал, а объявил выговор'],
	'верный ответ': '6,3 млн рублей',
	'пояснения к ответам': [`<b>Верно.</b> Проверка обнаружила просроченные продукты, но представители сети утверждают, что большая часть замечаний не коснулась их качества.`, 'Нет, немного больше: 6,3 млн рублей. Проверка обнаружила просроченные продукты, но представители сети утверждают, что большая часть замечаний не коснулась их качества.', 'Нет, гораздо меньше: 6,3 млн рублей. Проверка обнаружила просроченные продукты, но представители сети утверждают, что большая часть замечаний не коснулась их качества', 'Нет, всё же оштрафовал на 6,3 млн рублей. Проверка обнаружила просроченные продукты, но представители сети утверждают, что большая часть замечаний не коснулась их качества.']
},
{
'номер вопроса': 2,
'вопрос': 'Почему бутылку воды «Святой источник» в форме футбольного мяча сняли с продажи?',
'ответы': ['Она оказалась огнеопасной', 'Дети играли ею в футбол и разбивали окна', 'Она постоянно скатывалась с полок', 'Её никто не покупал'],
'верный ответ': 'Она оказалась огнеопасной',
'пояснения к ответам': ['Да, бутылка благодаря своей форме призмы фокусировала свет так, что он воспламенял окружающие предметы', 'Нет, дело в её форме призмы — она фокусировала свет так, что он воспламенял окружающие предметы', 'Бутылка была довольно устойчивая, но благодаря своей форме призмы фокусировала свет так, что он воспламенял окружающие предметы.', 'Её покупали, но бутылка благодаря своей форме призмы фокусировала свет так, что он воспламенял окружающие предметы.']
},
{
'номер вопроса': 3,
'вопрос': 'Сколько денег потеряли основатели WhatsApp после ухода из  Facebook?',
'ответы': ['Они лишились акций на $1,3 млрд','Они не только лишились акций на $1,3 млрд и выплатили штрафы на $100 млн','Ничего не лишились, к моменту ухода они уже получили всё вознаграждение','Ничего не лишились, но получили иски за нарушение коммерческой тайны'],
'верный ответ': 'Они лишились акций на $1,3 млрд',
'пояснения к ответам': ['Ян Кум и Брайан Эктон действительно могли получить акции на эту сумму, если бы проработали в Facebook до ноября 2018 года. Они ушли досрочно из-за конфликта с руководством.','Ян Кум и Брайан Эктон могли получить акции на $1,3 млрд, если бы проработали в Facebook до ноября 2018 года. Они ушли досрочно из-за конфликта с руководством, но штрафы никто не выплачивал.','Ян Кум и Брайан Эктон могли получить акции на $1,3 млрд, если бы проработали в Facebook до ноября 2018 года. Они ушли досрочно из-за конфликта с руководством.','Ян Кум и Брайан Эктон могли получить акции на $1,3 млрд, если бы проработали в Facebook до ноября 2018 года. Они ушли досрочно из-за конфликта с руководством — но коммерческую тайну пока никто не нарушил.']
},
{
'номер вопроса': 4,
'вопрос': 'В какой скандал угодила компания «Газелькин» в июне 2018 года?',
'ответы': ['Предложила клиентам вызвать «водителей-славян» за дополнительную плату','Её «Газели» постоянно застревали под мостом с надписью «Газель не проедет»','Грузчики разбили антикварный шкаф стоимостью 163 млн рублей','Выложила персональные данные клиентов — телефоны, адреса, почты — в открытый доступ'],
'верный ответ': 'Предложила клиентам вызвать «водителей-славян» за дополнительную плату',
'пояснения к ответам': ['Компания дала клиентам возможность выбрать водителя славянской внешности и российского гражданства. После скандала она переименовала услугу в «идеальный русский язык»','Было пару раз, но не в июне. На самом деле компания дала клиентам возможность выбрать водителя славянской внешности и российского гражданства. После она переименовала услугу в «идеальный русский язык».','О таком случае не сообщалось, но зато компания дала клиентам возможность выбрать водителя славянской внешности и российского гражданства. После скандала она переименовала услугу в «идеальный русский язык».','О таком случае не сообщалось, но зато компания дала клиентам возможность выбрать водителя славянской внешности и российского гражданства. После скандала она переименовала услугу в «идеальный русский язык».']
},
{
'номер вопроса': 5,
'вопрос': 'Простой вопрос для передышки. До какого порога правительство собирается повысить НДС?',
'ответы': ['20%','19%','21%','Никто не собирается повышать НДС, зато повысят НДФЛ'],
'верный ответ': '20%',
'пояснения к ответам': ['Да, НДС собираются повысить с 18% до 20%. Кстати, вот чем это грозит','Нет, всё же именно НДС собираются повысить с 18% до 20%. Кстати, вот чем это грозит','Нет, НДС собираются повысить с 18% до 20%. Кстати, вот чем это грозит','Нет, всё же именно НДС собираются повысить с 18% до 20%. Кстати, вот чем это грозит']
},
{
'номер вопроса': 6,
'вопрос': 'Чем займётся Герман Клименко после ухода с поста советника президента по интернету?',
'ответы': ['Проектами в сфере цифровой медицины','Станет разрабатывать собственный мессенджер','Будет советником по медицине','Отправится в кругосветное путешествие'],
'верный ответ': 'Проектами в сфере цифровой медицины',
'пояснения к ответам': ['Верно','Это вполне возможно, но сперва он планирует заниматься проектами в сфере цифровой медицины','Нет, он планирует заниматься собственными проектами в сфере цифровой медицины.','Он планирует заниматься собственными проектами в сфере цифровой медицины.']
},
{
'номер вопроса': 7,
'вопрос': 'Какую услугу запустила «Студия Артемия Лебедева» на волне успеха «Экспресс-дизайна»?',
'ответы': ['Экспресс-дизайн не логотипов, а предметов — за 300 тысяч рублей','Сервис экспресс-маркетинга: за 500 тысяч рублей Артемий Лебедев лично весь месяц будет вести ваш блог','Экспресс-доставку обедов в офис','Создание визиток за 50 тысяч рублей'],
'верный ответ': 'Экспресс-дизайн не логотипов, а предметов — за 300 тысяч рублей',
'пояснения к ответам': ['Да, и заказчик точно так же обязан принять первый предложенный вариант','Речь об экспресс-дизайне предметов, и заказчик точно так же обязан принять первый предложенный вариант.','Речь об экспресс-дизайне предметов, и заказчик точно так же обязан принять первый предложенный вариант.','Речь об экспресс-дизайне предметов, и заказчик точно так же обязан принять первый предложенный вариант']
},
{
'номер вопроса': 8,
'вопрос': 'Что сказал Олег Тиньков в интервью Владимиру Познеру в рамках ПМЭФ-2018?',
'ответы': ['Это стыдно — нанимать людей, которыми нужно управлять','Я бы хотел, чтобы на моей гробовой доске было написано слово «Предприниматель»','Чтобы быть предпринимателем, не нужно никакого образования','Предприниматели должны быть звёздами и элитой общества'],
'верный ответ': 'Это стыдно — нанимать людей, которыми нужно управлять',
'пояснения к ответам': [`<b>Вопрос</b> был с подвохом: все эти фразы прозвучали в интервью.`,'Вопрос был с подвохом: все эти фразы прозвучали в интервью.','Вопрос был с подвохом: все эти фразы прозвучали в интервью','Вопрос был с подвохом: все эти фразы прозвучали в интервью.']
}
]

let results = [
{
	'правильных': 0,
	'Текст': 'Мне интересен футбол',
	'картинка': 'assets/0.png'
},
{
	'правильных': 3,
	'Текст': 'Читаю vc.ru с экрана попутчика в метро',
	'картинка': 'assets/3.png'
},
{
	'правильных': 5,
	'Текст': 'Бизнес это интересно, но где взять столько времени?',
	'картинка': 'assets/5.png'
},
{
	'правильных': 7,
	'Текст': 'Читаю vc.ru каждый день, но работать тоже нужно',
	'картинка': 'assets/7.png'
},
{
	'правильных': 8,
	'Текст': 'Я работаю в редакции vc.ru',
	'картинка': 'assets/8.png'
}
]


let index = 0;
let spWrapper = document.getElementById('sp__wrapper')
let correctAnswers = 0
let replaceTitle = index => {
	let currentQuestion = obj2[index]
	let questionCount = currentQuestion['номер вопроса']
	
	
	let test = document.createElement('div')
			test.innerHTML =  `<p>${questionCount + '/' + obj2.length}</p><h2 class='test__title'>${currentQuestion['вопрос']}</h2>`
			test.classList.add('test')
			document.body.appendChild(test)


			let createList = document.createElement('ul') //создаем ul
			createList.classList.add('test__list')
			createList.setAttribute('id','test__list')
			test.appendChild(createList)

			for (let j = 0 ; j < currentQuestion['ответы'].length; j++) { //созадем li 
				let createItem = document.createElement('li')
				createItem.classList.add('test__item')
				createItem.innerHTML = currentQuestion['ответы'][j]
				createList.appendChild(createItem)
				
				createItem.addEventListener('click', e => { //проверяем правильность ответа
					let createAnswerDescr = document.createElement('p')
					createAnswerDescr.classList.add('test__description')
					if (currentQuestion['ответы'][j] === currentQuestion['верный ответ']) {
						console.log('right') 
						// createItem.outerHTML = ''
						correctAnswers += 1
						console.log(correctAnswers)
						createItem.classList.add('test__item-right')
					} else {
						console.log('wrong!!!!!!')
						createItem.classList.add('test__item-wrong')
					}
					
					e.target.style.pointerEvents = "none";
					e.target.classList.add('active') // удаление других
					createList.childNodes.forEach(li => {
						if (!li.classList.contains('active')) {
							li.style.display = 'none'
						}
					})
						createAnswerDescr.innerHTML = currentQuestion['пояснения к ответам'][j]
						test.appendChild(createAnswerDescr)

						let createBtn = document.createElement('button') //создаем кнопку
						createBtn.classList.add('test__btn')
						createBtn.innerHTML = 'Продолжить'
						test.appendChild(createBtn)
						createBtn.addEventListener('click', e => {
							if (index < obj2.length - 1) {
								index += 1;
								replaceTitle(index);
							} else  { //финальный экран		
								addFinal()
							}
						})
				})
				
			}
			document.querySelector(".test").replaceWith(test)
}


document.querySelector(".sp__btn").addEventListener("click", () => {
	spWrapper.remove();
	const test = document.createElement("div");
	test.classList.add("test");
	document.querySelector(".sp").append(test);
	replaceTitle(index);
	});

let addFinal = () => {
	let test = document.querySelector('.test')
	let finalScreen = document.createElement('div')
	finalScreen.classList.add('test__final')
	test.replaceWith(finalScreen)
	let sum 
	let pic
	for(result of results) {
		if(result['правильных'] < correctAnswers) {
			sum = result['Текст']
			pic = result['картинка']
		}else if (result['правильных'] === correctAnswers) {
			sum = result['Текст']
			pic = result['картинка']
    }
		/**if(correctAnswers >= 0 && result['правильных'] < 3) {
			finalScreen.innerHTML = result['Текст']
		}
		if(correctAnswers >= 3 && result['правильных'] < 5) {
			finalScreen.innerHTML = result['Текст']
		}
		
		if(correctAnswers >= 5 && result['правильных'] < 7) {
			finalScreen.innerHTML = result['Текст']
		}
		if(correctAnswers >= 7 && result['правильных'] < 8) {
			finalScreen.innerHTML = result['Текст']
		}
		if(correctAnswers === 8 && result['правильных'] === 8) {
			finalScreen.innerHTML = result['Текст']
		}*/
		finalScreen.innerHTML = `
		<h3>${correctAnswers} из ${obj2.length} правильных ответов</h3>
		<div class="test__final_wrapper">
			<p class="test__final_text">${sum}</p>
			<ul class="test__final_list">
				<li><button>facebook.com Поделиться</button></li>
				<li><button>vk.com</button></li>
				<li><button>twitter.com</button></li>
			</ul>
			<button class="test__btn" onclick="doAgain()">Пройти еще раз</button>
		</div>
		`//<img src="${pic}">
		document.querySelector('.test__final_wrapper').style.backgroundImage = `
		url(${pic})
		`
	}
}

let doAgain = (index) => {
	index = 0
	correctAnswers = 0
	replaceTitle(index)
	let test = document.querySelector('.test')
	document.querySelector('.test__final').replaceWith(test)
}


document.querySelector('.header__mob').addEventListener('click', () => {
	let menu = document.querySelectorAll('.header__nav')
	menu.forEach(element => element.classList.toggle('header__nav--active'))
})